---
kind: type
id: T:Autodesk.Revit.DB.IViewSheetSet
source: html/4c3ef0b6-6d63-1e58-cff4-aabd4d8f75a2.htm
---
# Autodesk.Revit.DB.IViewSheetSet

This interface represents a selected set of views/sheets which will be used for printing.

## Syntax (C#)
```csharp
public interface IViewSheetSet
```